plonas/winsens/src/hardware/ble_peripheral/nrf52/ble_peripheral.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            LOG_NRF_ERROR_CHECK(err_code);
        } break;

#if (NRF_SD_BLE_API_VERSION == 3)
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            WS_LOG_NRF_WARNING_CHECK(err_code);
            break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

        case BLE_GATTS_EVT_WRITE:
            const ble_gatts_evt_write_t *write_evt = p_ble_evt->evt.gatts_evt.params.write;
            const ble_peripheral_char_id_t char_id = get_char_id(write_evt->handle);
            ble_peripheral_update_t update_data = { .server_id = g_characteristics[char_id].service_id, .char_id = char_id, .value_len = write_evt->len, .value = write_evt->data };

            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_WRITE, .data = (winsens_event_data_t)&update_data };
            evt_handler(e);
            break;

        default:
            LOG_DEBUG("ws_on_ble_evt event %u not handled", p_ble_evt->header.evt_id);
            // No implementation needed.
            break;
    }
}

static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        NRF_LOG_INFO("GATT ATT MTU on connection 0x%x changed to %d.",
                     p_evt->conn_handle,
                     p_evt->params.att_mtu_effective);
    }
}

static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            LOG_INFO("Connected to a previously bonded device.");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            LOG_INFO("Connection secured. Role: %d. conn_handle: %d, Procedure: %d, peerId: %d",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure,
                         p_evt->peer_id);
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_BONDED, .data = 0 };
            evt_handler(e);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_UNBONDED, .data = true };
            evt_handler(e);
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Don't reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = true};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                LOG_NRF_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_UNBONDED, .data = true };
            evt_handler(e);
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            LOG_NRF_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            LOG_NRF_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            LOG_NRF_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_UNBONDED, .data = false };
            evt_handler(e);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            LOG_NRF_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}

static void on_conn_params_evt_handler(ble_conn_params_evt_t * p_evt)
{
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        uint32_t err_code = sd_ble_gap_disconnect(g_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        LOG_NRF_WARNING_CHECK(err_code);
    }
}

static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void evt_handler(winsens_event_t event)
{
    LOG_DEBUG("evt_handler %d", event.id);
    g_current_state->evt_handler(event);
}

static void change_state(const ble_peripheral_state_t *new_state)
{
    LOG_DEBUG("%s -> %s", (uint32_t) convert_state_to_str(g_current_state->state_id), (uint32_t) convert_state_to_str(new_state->state_id));

