plonas/winsens/src/hardware/ble_peripheral/nrf52/ble_peripheral.c
    g_current_state->exit_state();
    g_current_state = new_state;
    g_current_state->enter_state();
}

static void connected_evt_handler(
    winsens_event_t event)
{
    if (BLE_PERIPHERAL_EVT_DISCONNECT == event.id)
    {

    }
    else if (BLE_PERIPHERAL_EVT_DISCONNECTED == event.id)
    {
        change_state(&ADVERTISING_STATE);
    }
    else if (BLE_PERIPHERAL_EVT_WRITE == event.id)
    {
        notify_on_write((const ble_peripheral_update_t *)event.data);
    }
    else
    {
        LOG_INFO("Event %d in WS_Connected_evt_handler not handled", event.id);
    }
}

//static void connecting_evt_handler(
//    WS_Event_t event)
//{
//    if (BLE_PERIPHERAL_EVT_CONNECTED == event.id)
//    {
//        ws_conn_handle = event.data16a;
//        change_state(&connectedState);
//    }
//    else if (BLE_PERIPHERAL_EVT_DISCONNECTED == event.id)
//    {
//        change_state(&disconnectedState);
//    }
//    else
//    {
//        WS_LOG_WARNING("Event %d in WS_Connecting_evt_handler not handled", event.id);
//    }
//}

static void disconnected_evt_handler(
    winsens_event_t event)
{
    if (BLE_PERIPHERAL_EVT_CONNECTED == event.id)
    {
        g_conn_handle = event.data16a;
        change_state(&CONNECTED_STATE);
    }
    else
    {
        LOG_INFO("Event %d in WS_Disconnected_evt_handler not handled", event.id);
    }
}

static void disconnecting_evt_handler(
    winsens_event_t event)
{
    if (BLE_PERIPHERAL_EVT_DISCONNECTED == event.id)
    {
        change_state(&DISCONNECTED_STATE);
    }
    else
    {
        LOG_INFO("Event %d in WS_Disconnecting_evt_handler not handled", event.id);
    }
}

static void advertising_evt_handler(
    winsens_event_t event)
{
    if (BLE_PERIPHERAL_EVT_ADVERTISING_STOPPED == event.id)
    {
        change_state(&DISCONNECTED_STATE);
    }
    else if (BLE_PERIPHERAL_EVT_CONNECTED == event.id)
    {
        g_conn_handle = event.data16a;
        change_state(&CONNECTED_STATE);
    }
    else
    {
        LOG_INFO("Event %d in WS_Advertising_evt_handler not handled", event.id);
    }
}

static void bonding_evt_handler(
    winsens_event_t event)
{
    if (BLE_PERIPHERAL_EVT_BONDED == event.id)
    {
        change_state(&CONNECTED_STATE);
    }
    else if (BLE_PERIPHERAL_EVT_UNBONDED == event.id)
    {
        change_state(&CONNECTED_STATE);
    }
    else
    {
        LOG_INFO("Event %d in WS_Bonding_evt_handler not handled", event.id);
    }
}

static void unbonding_evt_handler(
    winsens_event_t event)
{
    if (BLE_PERIPHERAL_EVT_DISCONNECTED == event.id)
    {
        remove_all_bondings();
    }
    else if (BLE_PERIPHERAL_EVT_UNBONDED == event.id)
    {
        change_state(&DISCONNECTED_STATE);
    }
    else
    {
        LOG_INFO("Event %d in WS_Unbonding_evt_handler not handled", event.id);
    }
}

static void disconnected_on_enter(void)
{
    g_conn_handle = BLE_CONN_HANDLE_INVALID;
}

static void disconnecting_on_enter(void)
{
    disconnect(g_conn_handle);
}

static void advertising_on_enter(void)
{
    g_connectable = true;
    start_advertising(NULL);
}

static void bonding_on_enter(void)
{
    bond(g_conn_handle);
}

static void unbonding_on_enter(void)
{
    uint32_t err_code = sd_ble_gap_adv_stop(g_advertising.adv_handle);
    if (NRF_ERROR_INVALID_STATE != err_code && NRF_SUCCESS != err_code)
    {
        LOG_WARNING("Stopping advertising failed (%d)", err_code);
        return;
    }

    if (!disconnect(g_conn_handle))
    {
        remove_all_bondings();
    }
}

static void advertising_on_exit(void)
{
    g_connectable = false;
}

static void add_service(ble_peripheral_svc_t *svc)
{
    uint32_t err_code = sd_ble_uuid_vs_add(&svc->service_base_uuid, &svc->service_uuid.type);
    LOG_NRF_ERROR_CHECK(err_code);
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &svc->service_uuid,
                                        &svc->service_handle);
    LOG_NRF_ERROR_CHECK(err_code);
}

static void add_characteristic(ble_peripheral_char_t *charact)
{
    const ble_peripheral_svc_t *svc = &g_services[charact->service_id];

    //Add a custom characteristic UUID
    uint32_t            err_code;
    ble_uuid_t          char_uuid;

    err_code = sd_ble_uuid_vs_add(&svc->service_base_uuid, &charact->char_uuid.type);
    LOG_NRF_ERROR_CHECK(err_code);

    //Add read/write properties to our characteristic
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read = charact->read_enabled;
    char_md.char_props.write = charact->write_enabled;

    //Configuring Client Characteristic Configuration Descriptor metadata and add to char_md structure
    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc                = BLE_GATTS_VLOC_STACK;
    char_md.p_cccd_md           = &cccd_md;
    char_md.char_props.notify   = charact->notification_enabled;

    //Configure the attribute metadata
    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md));
    attr_md.vloc = BLE_GATTS_VLOC_STACK;

    //Set read/write security levels to our characteristic
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

    //Configure the characteristic value attribute
    ble_gatts_attr_t attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));
    attr_char_value.p_uuid = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;

    //Set characteristic length in number of bytes
    attr_char_value.max_len     = sizeof(bool);
    attr_char_value.init_len    = sizeof(bool);
//    attr_char_value.p_value     = charact->value;

    //Add our new characteristic to the service
    err_code = sd_ble_gatts_characteristic_add(svc->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &charact->char_handle);
    LOG_NRF_ERROR_CHECK(err_code);
}

static void remove_all_bondings(void)
{
    if (0 < pm_peer_count())
    {
        uint32_t err_code = pm_peers_delete();
        LOG_NRF_WARNING_CHECK(err_code);
    }
    else
    {
        change_state(&DISCONNECTED_STATE);
    }
}

static bool disconnect(uint16_t connHandle)
{
    uint32_t err_code = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    LOG_NRF_WARNING_RETURN(err_code, false);
    return true;
}

