plonas/winsens/src/hardware/ble_peripheral/nrf52/ble_peripheral.c
static void start_advertising(ble_gap_addr_t* addr)
{
    ret_code_t err_code = ble_advertising_start(&g_advertising, BLE_ADV_MODE_FAST);
    LOG_NRF_ERROR_CHECK(err_code);
}

static bool bond(uint16_t connHandle)
{
    pm_peer_id_t peerId = PM_PEER_ID_INVALID;
    ret_code_t ret = pm_conn_secure(connHandle, false);
    LOG_NRF_WARNING_RETURN(ret, false);
    ret = pm_peer_id_get(connHandle, &peerId);
    LOG_NRF_WARNING_RETURN(ret, false);
    return add_to_whitelist(peerId);
}

static bool add_to_whitelist(pm_peer_id_t peerId)
{
    for (uint8_t i = 0; i < WHITELIST_LEN; ++i)
    {
        if (PM_PEER_ID_INVALID == g_whitelist[i])
        {
            g_whitelist[i] = peerId;
            return true;
        }
    }
    return false;
}

static void notify_on_write(const ble_peripheral_update_t *update_data)
{
    for (uint16_t i = 0; i < BLE_PERIPERAL_MAX_CALLBACKS; ++i)
    {
        if (g_callbacks[i])
        {
            g_callbacks[i](update_data);
        }
    }
}

static ble_peripheral_char_id_t get_char_id(uint16_t attr_handle)
{
    for (ble_peripheral_char_id_t i = 0; i < CHARACTERISTICS_NUMBER; ++i)
    {
        if (attr_handle == g_characteristics[i].char_handle)
        {
            return i;
        }
    }

    return BLE_PERIPHERAL_CHAR_ID_INVALID;
}

static char const * convert_state_to_str(ble_peripheral_state_enum_t state)
{
    switch (state)
    {
    case BLE_PERIPHERAL_STATE_ADVERTISING:      return UTILS_STRING(BLE_PERIPHERAL_STATE_ADVERTISING);
    case BLE_PERIPHERAL_STATE_BONDING:          return UTILS_STRING(BLE_PERIPHERAL_STATE_BONDING);
    case BLE_PERIPHERAL_STATE_CONNECTED:        return UTILS_STRING(BLE_PERIPHERAL_STATE_CONNECTED);
    case BLE_PERIPHERAL_STATE_CONNECTING:       return UTILS_STRING(BLE_PERIPHERAL_STATE_CONNECTING);
    case BLE_PERIPHERAL_STATE_DISCONNECTED:     return UTILS_STRING(BLE_PERIPHERAL_STATE_DISCONNECTED);
    case BLE_PERIPHERAL_STATE_DISCONNECTING:    return UTILS_STRING(BLE_PERIPHERAL_STATE_DISCONNECTING);
    case BLE_PERIPHERAL_STATE_UNBONDING:        return UTILS_STRING(BLE_PERIPHERAL_STATE_UNBONDING);
    case BLE_PERIPHERAL_STATE_UNKNOWN:          return UTILS_STRING(BLE_PERIPHERAL_STATE_UNKNOWN);
    }

    return "unknown state";
}
